app/controllers/posts_controller.rb

SELECT "posts".* FROM "posts" ORDER BY created_at DESC LIMIT ? OFFSET ?  [["LIMIT", 20], ["OFFSET", 0]]
---
  def index
    @posts = Post.all.order("created_at DESC").paginate(:page => params[:page], :per_page => 20)

SELECT "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def vote_up
    begin
      postt=@post = Post.find(params[:id])

SELECT "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 8], ["LIMIT", 1]]
---
  def vote_down
    begin
      postt=@post = Post.find(params[:id])

SELECT "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def vote_undo
    begin
      postt=@post = Post.find(params[:id])

INSERT INTO "posts" ("description", "created_at", "updated_at", "user_id", "image_file_name", "image_content_type", "image_file_size", "image_updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @post = current_user.posts.build(post_params)


    respond_to do |format|
      if @post.save